**`teams/nomis/rhel_7_9_baseimage`** terraform plan on `pull_request` event [#433](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/rhel_7_9_baseimage/rhel_7_9_baseimage.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-7-9-baseimage/1.1.5/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: rhel_7_9_baseimage
            description: RHEL7.9 BaseImage provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: "1.1.5"
          +       default: "1.1.6"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: UpdateOS
                    action: UpdateOS
            
                  - name: InstallPackages
                    action: ExecuteBash
                    inputs:
                      commands:
                        - sudo yum install wget curl unzip git nc ca-certificates gcc screen zlib-devel bzip2-devel openssl-devel libffi-devel  -y
            
                  - name: InstallPython3-9
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install python 3.9
                          wget https://www.python.org/ftp/python/3.9.6/Python-3.9.6.tgz
                          tar xzf Python-3.9.6.tgz
                          rm -f Python-3.9.6.tgz
                          cd Python-3.9.6
                          ./configure --enable-optimizations
                          sudo make altinstall
            
                  # Install node exporter agent with ansible
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install, create, activate virtual environment
                          pip3.9 install virtualenv
                          mkdir /tmp/python-venv && cd "$_"
                          python3.9 -m venv ansible
                          source ansible/bin/activate
            
                          # Install ansible modules in virtual env
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install ansible==6.0.0
            
                          # Download playbook
                          mkdir /tmp/node-exporter-ansible-playbook && cd "$_"
          -               echo "Cloning using branch=nomis/DSOS-1478/fix-rhel79-image"
          -               git clone -b nomis/DSOS-1478/fix-rhel79-image --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
          +               echo "Cloning using branch=main"
          +               git clone -b main --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
                          cd modernisation-platform-ami-builds/ansible
            
                          # Install requirements in virtual env
                          python3.9 -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml
            
                          # Get required extra vars and run ansible
                          PY_INTERPRETER=$(which python3.9)
                          ansible-playbook ../teams/nomis/ansible/playbooks/node-exporter-install.yml \
                          --connection=local \
                          --inventory localhost \
                          --extra-vars "ansible_python_interpreter=$PY_INTERPRETER" \
                          --become
            
                          # Deactivate virtual env and cleanup
                          deactivate
                          rm -rf /tmp/python-venv
                          rm -rf /tmp/node-exporter-ansible-playbook
        EOT
      ~ date_created          = "2022-09-13T18:26:46.723Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-7-9-baseimage/1.1.5/1" -> (known after apply)
        name                  = "rhel_7_9_baseimage"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.1.5" -> "1.1.6" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-baseimage"
        name         = "nomis_rhel_7_9_baseimage"
      ~ tags         = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-baseimage" -> (known after apply)
      ~ date_created                     = "2022-09-13T18:26:51.901Z" -> (known after apply)
      ~ date_last_run                    = "2022-09-13T18:28:26.420Z" -> (known after apply)
      ~ date_next_run                    = "2022-10-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-13T18:26:51.901Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-baseimage" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.2.8" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-2-8" -> (known after apply)
        name                             = "nomis_rhel_7_9_baseimage"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ image_tests_configuration {
          ~ image_tests_enabled = true -> false
            # (1 unchanged attribute hidden)
        }

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.2.8" -> (known after apply)
      ~ date_created     = "2022-09-13T18:26:50.460Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.2.8" -> (known after apply)
        name             = "nomis_rhel_7_9_baseimage"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "1.2.8" -> "1.2.9" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-7-9-baseimage/1.1.5/1" -> (known after apply) # forces replacement
        }

        # (5 unchanged blocks hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-2-8" -> (known after apply)
      ~ date_created                  = "2022-09-13T18:26:46.991Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-2-8" -> (known after apply)
      ~ name                          = "nomis_rhel_7_9_baseimage_1_2_8" -> "nomis_rhel_7_9_baseimage_1_2_9" # forces replacement
      ~ resource_tags                 = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "branch"                                = "nomis/DSOS-1478/fix-rhel79-image" -> "main"
          ~ "image-recipe"                          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "infrastructure-configuration"          = "nomis_rhel_7_9_baseimage/1.2.8" -> "nomis_rhel_7_9_baseimage/1.2.9"
          ~ "is-production"                         = "false" -> "true"
          ~ "rhel_7_9_baseimage-version"            = "1.1.5" -> "1.1.6"
            # (12 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```